[
  {
    "id": "Beginning",
    "prompt_text": "You find yourself in the Temple of the Kyber, but Imperial forces are searching the area. Do you try to outwit them or hide?",
    "passing_attributes": {
      "Mind Tricks": "You use a mind trick to make the Imperials forget they saw you.",
      "Dexterity": "You skillfully hide behind debris, avoiding the search."
    },
    "partial_pass_attributes": {
      "Intelligence": "You manage to evade them, but they become suspicious."
    },
    "fail": {
      "message": "The Imperials spot you and capture you for questioning."
    },
    "outcomes": {
      "pass": ["hidden_knowledge"],
      "partial_pass": ["hidden_location"],
      "fail": ["interrogation"]
    }
  },
  {
    "id": "hidden_knowledge",
    "prompt_text": "An ancient artifact lies buried in the sands of Jedha. Do you attempt to unearth it using your knowledge or brute strength?",
    "passing_attributes": {
      "Intelligence": "You cleverly analyze the surroundings and recover the artifact without damage.",
      "Strength": "You use your physical power to pull the artifact from the ground.",
      "Force Sensitivity": "You force push away the sands to unearth the artifact."
    },
    "partial_pass_attributes": {
      "Dexterity": "You uncover part of the artifact, but it's stuck."
    },
    "fail": {
      "message": "Your efforts fail, and the artifact remains buried."
    },
    "outcomes": {
      "pass": ["deeper_access"],
      "partial_pass": ["ancient_insight"],
      "fail": ["secured_supplies"]
    }
  },
  {
    "id": "ancient_insight",
    "prompt_text": "A group of scavengers on Jedha offers to trade supplies, but they seem untrustworthy. Do you negotiate or prepare for a possible attack?",
    "passing_attributes": {
      "Intelligence": "You outsmart the scavengers and secure a good deal.",
      "Blaster Proficiency": "You stay prepared and dissuade them from any hostile action."
    },
    "partial_pass_attributes": {
      "Force Sensitivity": "You sense their intent but aren't quick enough to act."
    },
    "fail": {
      "message": "The scavengers deceive you, and you lose valuable supplies and return to the entrence of the temple."
    },
    "outcomes": {
      "pass": ["secured_supplies"],
      "partial_pass": ["deeper_access"],
      "fail": ["Beginning"]
    }
  },
  {
    "id": "secured_supplies",
    "prompt_text": "You've discovered a hidden chamber within the Temple of the Kyber. It contains powerful relics, but the energy is unstable. Do you attempt to stabilize the energy field or take a relic quickly?",
    "passing_attributes": {
      "Force Sensitivity": "You stabilize the energy field, allowing you to safely take a relic.",
      "Hacking": "You override the energy systems to stabilize them temporarily."
    },
    "partial_pass_attributes": {
      "Intelligence": "You manage to take a relic, but the energy field fluctuates dangerously."
    },
    "fail": {
      "message": "The energy field destabilizes, and you are knocked back by a surge but the scavengers come back while you are unconscious."
    },
    "outcomes": {
      "pass": ["relic_gain"],
      "partial_pass": ["gathering_info"],
      "fail": ["anciet_insight"]
    }
  },
  {
    "id": "relic_gain",
    "prompt_text": "The Temple's defenses activate as you explore deeper. Do you try to disable them or find a way around?",
    "passing_attributes": {
      "Hacking": "You successfully disable the temple's defenses and enter a hidden dock within the temple.",
      "Dexterity": "You manage to navigate through the defenses without triggering them and end up at a hidden empire dock within the temple."
    },
    "partial_pass_attributes": {
      "Blaster Proficiency": "You shoot some of the defenses but set off an alarm."
    },
    "fail": {
      "message": "You trigger the defenses and a group of stormtroopers capture you."
    },
    "outcomes": {
      "pass": ["docking_area"],
      "partial_pass": ["captured_on_shuttle"],
      "fail": ["interrogation"]
    }
  },
  {
    "id": "deeper_access",
    "prompt_text": "You venture deeper into the Temple of the Kyber and discover a hidden archive. Do you study the ancient texts or search for hidden compartments?",
    "passing_attributes": {
      "Intelligence": "You decipher the ancient texts, gaining invaluable knowledge about the Force and the plans of the star destoryer.",
      "Dexterity": "You skillfully find hidden compartments containing lost artifacts and plans of the star destroyer."
    },
    "partial_pass_attributes": {
      "Force Sensitivity": "You sense the presence of the Force but can't pinpoint its source however, you end up finding a room with relics."
    },
    "fail": {
      "message": "You end up failing to decipher the texts and can't find any hidden compartments so you move on into another room."
    },
    "outcomes": {
      "pass": ["gathering_info"],
      "partial_pass": ["secured_supplies"],
      "fail": ["relic_gain"]
    }
  },
  {
    "id": "interrogation",
    "prompt_text": "You are captured by the empire and are interrogated for rebel secrets",
    "passing_attributes": {
      "Mind Tricks": "You tick the gurads into freeing you and make your escape into a strange room in the temple.",
      "Hacking": "You override the locking mechanism on your cell and make your escape, as you turn a corner you find yourself deeper into the temple."
    },
    "partial_pass_attributes": {
      "Blaster Proficiency": "While the guards are distracted you take out the blaster you have hidden and shoot the guards but they injure you run away into the compound."
    },
    "fail": {
      "message": "You are interrogated ruthlessly and give up rebel secrets but your friends come to save you. However, you lose ground and end up back where you started."
    },
    "outcomes": {
      "pass": ["deeper_access"],
      "partial_pass": ["deeper_access"],
      "fail": ["Beginning"]
    }
  },
  {
    "id": "gathering_info",
    "prompt_text": "Before making your move, you need more information about the Star Destroyer's patrols. Do you eavesdrop on Imperial officers or analyze security feeds?",
    "passing_attributes": {
      "Intelligence": "You cleverly analyze the feeds to gather valuable information.",
      "Mind Tricks": "You use a mind trick to get an officer to reveal the patrol schedule."
    },
    "partial_pass_attributes": {
      "Dexterity": "You stealthily move to listen in but are spotted briefly."
    },
    "fail": {
      "message": "The officers catch you eavesdropping, and you must escape."
    },
    "outcomes": {
      "pass": ["docking_area"],
      "partial_pass": ["intel_gathered"],
      "fail": ["stormtrooper_chase"]
    }
  },
  {
    "id": "intel_gathered",
    "prompt_text": "With the patrol schedule in hand, you plan your entry. Do you choose a stealthy approach through the back alleys or create a diversion?",
    "passing_attributes": {
      "Dexterity": "You navigate the back alleys and reach the docking area undetected where you find your shuttle.",
      "Blaster Proficiency": "You create a diversion by firing at nearby equipment, drawing the guards away this gives you time to get onboard the shuttle."
    },
    "partial_pass_attributes": {
      "Strength": "You attempt to push past some guards but attract their attention. However, you end up at another dock that is unguarded."
    },
    "fail": {
      "message": "The guards see through your plan and alert the rest of the troops you run away into a strange part of the temple."
    },
    "outcomes": {
      "pass": ["successful_launch"],
      "partial_pass": ["docking_area"],
      "fail": ["secured_supplies"]
    }
  },
  {
    "id": "docking_area",
    "prompt_text": "You've reached the docking area. Do you attempt to board an unguarded shuttle or look for a maintenance hatch?",
    "passing_attributes": {
      "Dexterity": "You quickly board the unguarded shuttle and prepare it for takeoff.",
      "Hacking": "You find a maintenance hatch and access the Star Destroyer through the service tunnels."
    },
    "partial_pass_attributes": {
      "Strength": "You manage to pry open the hatch, but it makes a loud noise as you make your escape you hear some plans."
    },
    "fail": {
      "message": "A patrol finds you trying to board, and you must fight your way out. You end up defeating you enemys but they push you deeper into the temple"
    },
    "outcomes": {
      "pass": ["onboard_shuttle"],
      "partial_pass": ["intel_gathered"],
      "fail": ["deeper_access"]
    }
  },
  {
    "id": "onboard_shuttle",
    "prompt_text": "You are on the shuttle, but the launch sequence requires a code. Do you hack the terminal or bluff your way past the guards?",
    "passing_attributes": {
      "Hacking": "You successfully bypass the terminal's security and launch the shuttle.",
      "Deception": "You convince the guards that you’re authorized personnel."
    },
    "partial_pass_attributes": {
      "Mind Tricks": "You attempt a mind trick, but it only partially works."
    },
    "fail": {
      "message": "The terminal locks down, and alarms start blaring as guards rush in."
    },
    "outcomes": {
      "pass": ["successful_launch"],
      "partial_pass": ["stormtrooper_chase"],
      "fail": ["captured_on_shuttle"]
    }
  },
  {
    "id": "successful_launch",
    "prompt_text": "The shuttle launches successfully, and you find yourself heading towards the Star Destroyer. Do you take a direct approach or attempt to sneak in through a lesser-known docking bay?",
    "passing_attributes": {
      "Piloting": "You expertly maneuver the shuttle, evading detection.",
      "Dexterity": "You identify and approach a lesser-known docking bay that is less guarded."
    },
    "partial_pass_attributes": {
      "Blaster Proficiency": "You engage in a dogfight with nearby TIE fighters but manage to evade them."
    },
    "fail": {
      "message": "Your approach is detected, and the Star Destroyer's defenses activate against you. You return back to the dock to land and attempt a new plan."
    },
    "outcomes": {
      "pass": ["docked_inside"],
      "partial_pass": ["docked_inside"],
      "fail": ["onboard_shuttle"]
    }
  },
  {
    "id": "docked_inside",
    "prompt_text": "You have docked inside the Star Destroyer. Your mission begins. Do you head for the control room or look for a way to sabotage the ship?",
    "passing_attributes": {
      "Intelligence": "You quickly formulate a plan and lead your team to the control room.",
      "Hacking": "You find systems to sabotage to weaken the Star Destroyer."
    },
    "partial_pass_attributes": {
      "Mind Tricks": "You use a mind trick to manipulate a guard, but it backfires slightly."
    },
    "fail": {
      "message": "You are spotted immediately, and alarms begin to sound."
    },
     "outcomes": {
      "pass": ["successful_launch"],
      "partial_pass": ["gathering_info"],
      "fail": ["stormtrooper_chase"]
    }
  },
  {
    "id": "captured_on_shuttle",
    "prompt_text": "You have been captured on the shuttle and they plan to take you to the main cell on the star destroyer!",
    "passing_attributes": {
      "lightsaber_proficiency": "You use your lightsaber to defeat the guards and take their suits to blend in on the star destroyer.",
      "Hacking": "You hack the ship and lock out the guards before they reach you.",
      "Blaster Proficiency": "You shoot the guards and end up leaving to the star destroyer before more guards are alerted."
    },
    "partial_pass_attributes": {
      "Mind Tricks": "You use a mind trick to manipulate a guard, but they see past the tick and incapacitate to bring to their superior on the star destroyer."
    },
    "fail": {
      "message": "You are spotted immediately and stormed off the ship as stormtroopers chase you!"
    },
    "outcomes": {
      "pass": ["successful_launch"],
      "partial_pass": ["gathering_info"],
      "fail": ["stormtrooper_chase"]
    }
  },
  {
    "id": "stormtrooper_chase",
    "prompt_text": "You are being chased by a group of stormtroopers what will you do!?",
    "passing_attributes": {
      "lightsaber_proficiency": "You fight off the guards with your lightsaber skills and enter the docking area ",
      "Strength": "You use your strength to overwhelm the stoormtroopers and enter the docking area.",
      "Blaster Proficiency": "You shoot the stormtroopers and enter a new docking area."
    },
    "partial_pass_attributes": {
      "Mind Tricks": "You use a mind trick to manipulate a guard, but they see past the tick and incapacitate to bring to their superior on the star destroyer.",
      "processing": "You process the surrounding area quickly and find a new route to reach an empty empirial shuttle"
    },
    "fail": {
      "message": "You are spotted immediately and stormed off the ship as stormtroopers chase you!"
    },
    "outcomes": {
      "pass": ["successful_launch"],
      "partial_pass": ["onboard_shuttle"],
      "fail": ["captured_on_shuttle"]
    }
  }
]
    