[
  {
    "passing_attributes": {
      "Lightsaber Proficiency": "You deflected the blaster shots back at the stormtroopers and took them all out, allowing you to continue.",
      "Blaster Proficiency": "Your party opens fire on the troopers, luckily their aim isn't too hot and you take them all out."
    },
    "partial_pass_attributes": {
      "Force Sensitvity": "You push all the troopers to the ground, but they are quickly getting up to regroup, what do you do?"
    },
    "prompt_text": "Your party turns a corner to find a platoon of stormtroopers down the hall, who turn your way and take aim, what will you use to help?",
    "fail": {
      "message": "The party gets blasted, and you retreat back around the corner."
    }
  },
  {
    "passing_attributes": {
      "Hacking": "Hacking the doors control panel makes them swing open, and your party can continue.",
      "Lightsaber Proficiency": "You cut a hole through the door, and you're allowed to pass through.",
      "Intelligence": " You use your intellect to decipher the codes and open the door."
    },
    "partial_pass_attributes": {
      "Processing": " the find that the door is very advanced, and needs decrypting to open, what do you do?"
    },
    "prompt_text": "Your party comes across a locked armored door with a control panel, what do you do?",
    "fail": {
      "message": "That method proves ineffective, what else could you try?"
    }
  },
  {
    "passing_attributes": {
      "Mind Tricks": "You trick the troopers that they never saw you, and they walk away",
      "Dexterity": "You quickly grab one of the troopers guns and turn it against him, taken off guard your party takes out the troopers."
    },
    "partial_pass_attributes": {
      "Intelligence": "You try to reason with the troopers, but it doesn't seem to be working"
    },
    "prompt_text": "While traveling you are suddenly ambushed by troopers who end up behind you. What do you do?",
    "fail": {
      "message": "The troopers take you captive, and you get blasted."
    }
  },
  {
    "passing_attributes": {
      "Force Sensitivty": "You sense the force of your enemys and are able to predict their every move.",
      "Piloting": "You manuver around an asteriod belt and make swift work of the tie fighters.",
      "Processing": "With quick processing you are able to lock onto the tie fighters and take out your enemys."
    },
    "partial_pass_attributes": {
      "Intelligence": "You attempt to get to the Falcon but realise you are too far away and make a run for it further into the compound."
    },
    "prompt_text": "While searching the compound you enter a hangerbay and spot the Milenium Falcon. You enter the aircraft and travel out the compound. Suddenly! you get spotted by a group of Tie-figlters! What do you do...?",
    "fail": {
      "message": "The Tie-fighters shoot the Melenium Falcon and your thruster is destroyed so you run away and land back in the compoud."
    }
  },
  {
    "passing_attributes": {
      "Force Sensitivty": "You sense the force of your enemys and are able to predict their every move.",
      "Piloting": "You manuver around an asteriod belt and make swift work of the tie fighters.",
      "Processing": "With quick processing you are able to lock onto the tie fighters and take out your enemys."
    },
    "partial_pass_attributes": {
      "Intelligence": "You attempt to get to the Falcon but realise you are too far away and make a run for it further into the compound."
    },
    "prompt_text": "While searching the compound you enter a hangerbay and spot the Milenium Falcon. You enter the aircraft and travel out the compound. Suddenly! you get spotted by a group of Tie-figlters! What do you do...?",
    "fail": {
      "message": "The Tie-fighters shoot the Melenium Falcon and your thruster is destroyed so you run away and land back in the compoud."
    }
  }
]